app/Services/ComboService.php

select count(*) as aggregate from `combos`
---
    public function getAllComboService($perPage = 10, string $latest = 'id')
    {
        return Combo::query()->with('comboFood')->latest($latest)->paginate($perPage);