app/Services/DayService.php

    public function getAllDays()
    {
        return Day::latest()->paginate(5);
---
select * from `days` order by `created_at` desc limit 5 offset 0
select count(*) as aggregate from `days`

    public function createDay($data)
    {
        return DB::transaction(function () use ($data) {
            return Day::create($data);
---
insert into `days` (`name`, `day_surcharge`, `updated_at`, `created_at`) values ('Giáng sinh', '20000', '2025-02-12 16:02:28', '2025-02-12 16:02:28')