app/Services/FoodService.php

        public function getAllFoodService()
        {
            return Food::latest()->paginate(10);
---
select * from `food` where `food`.`deleted_at` is null order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `food` where `food`.`deleted_at` is null