app/Services/RoomService.php

    public function getService($request)
    {
        $branchs = Branch::with('cinemas')->where('is_active', 1)->get();
        $branchsRelation = [];
        foreach ($branchs as $branch) {
            $branchsRelation[$branch['id']] = $branch->cinemas->pluck('name', 'id');
        }
        $seat_templates = Seat_template::query()->where('is_active', 1)->get();

        $type_rooms = Type_room::query()->pluck('name', 'id')->all();
        $rooms = Room::with('branch','cinema','seat_template','type_room')->latest('id')->paginate(10);
---
select * from `branches` where `is_active` = 1
select * from `cinemas` where `cinemas`.`branch_id` in (1, 2, 3, 4, 5)
select * from `seat_templates` where `is_active` = 1
select `name`, `id` from `type_rooms`
select * from `branches` where `branches`.`id` in (1, 2, 3, 4, 5)
select * from `cinemas` where `cinemas`.`id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10)
select * from `seat_templates` where `seat_templates`.`id` in (1)
select * from `type_rooms` where `type_rooms`.`id` in (1, 2, 3)

    public function updateService(array $data , string $id){
        $room = Room::findOrFail($id);
---
select * from `type_rooms` where `type_rooms`.`id` in (1, 2, 3)

    public function showService(string $id){
        $room = Room::with('branch','cinema','seat_template','type_room')->findOrFail($id);
---
select * from `branches` where `branches`.`id` in (1, 2, 3, 4, 5)
select * from `cinemas` where `cinemas`.`id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10)
select * from `seat_templates` where `seat_templates`.`id` in (1)