app/Services/SeatTemplateService.php

    public function getAll($request)
    {
        $query = Seat_template::query()->latest('id');
        if ($request->has('name') && $request->query('name', '') != "") {
            $name = $request->query('name', '');
            $query->where('name', 'LIKE', "%$name%");
        }


        return  $query->paginate(10);
---
select * from `seat_templates` order by `id` desc limit 10 offset 0
select count(*) as aggregate from `seat_templates`

    public function storeService(array $data)
    {
        return Seat_template::query()->create($data);
---
insert into `seat_templates` (`name`, `matrix`, `row_regular`, `row_vip`, `row_double`, `description`, `updated_at`, `created_at`) values ('Trần Minh Hải', '2', '4', '7', '2', 'a', '2025-02-12 00:14:25', '2025-02-12 00:14:25')