app/Services/ShowtimeService.php

            ];
        });

        $branchs = Branch::with('cinemas.rooms')->where('is_active', 1)->get();
---
select * from `branches` where `is_active` = 1
select * from `cinemas` where `cinemas`.`branch_id` in (1, 2, 3, 4, 5)
select * from `rooms` where `rooms`.`cinema_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10)

        }
        $query = Movie::with('movieBranches')->where('is_active', 1);
        if (Auth::user()->branch_id) {
            $query = $query->whereHas('movieBranches', function ($q) {
                $q->where('branch_id', Auth::user()->branch_id);
            });
---
select * from `branches` where `is_active` = 1
select * from `movies` where `is_active` = 1

    public function createService(string $id)
    {
        $query = Branch::with('cinemas.rooms')->where('is_active', 1);
        if (Auth::user()->branch_id) {
            $query = $query->where('id', Auth::user()->branch_id);
        }
        $branchs = $query->get();

        $branchsRelation = [];
        foreach ($branchs as $branch) {
            $branchsRelation[$branch['id']] = $branch->cinemas->where('is_active', 1)->pluck('name', 'id')->all();
        }
        $roomsRelation = [];
        foreach ($branchs as $branch) {
            foreach ($branch->cinemas as $cinema) {
                $roomsRelation[$cinema['id']] = $cinema->rooms->where('is_active', 1)->pluck('name', 'id')->all();
            }
        }
        $rooms = Room::with('type_room')->where('is_active', 1)->get();
        $movie = Movie::query()->findOrFail($id);
        $days = Day::query()->get();
        $slug = Showtime::generateCustomRandomString();
        $specialshowtimes = Showtime::SPECIALSHOWTIMES;
        $type_rooms = Type_room::query()->get();
        $type_seats = Type_seat::query()->get();
---
select * from `cinemas` where `cinemas`.`branch_id` in (1, 2, 3, 4, 5)
select * from `rooms` where `rooms`.`cinema_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10)
select * from `type_rooms` where `type_rooms`.`id` in (1, 2, 3)
select * from `movies` where `movies`.`id` = '6' limit 1
select * from `days`
select * from `type_seats`