app/Services/TypeRoomService.php

    public function storeService(array $data)
    {
        return Type_room::create($data);
---
insert into `type_rooms` (`name`, `surcharge`, `updated_at`, `created_at`) values ('bebeb', '100', '2025-02-12 00:05:46', '2025-02-12 00:05:46')