app/Services/UserService.php

select * from `users` where `email` = 'admin@gmail.com' limit 1
---
    public function getUserApi($email)
    {
        try {
            // Tìm user theo email
            $user = User::where('email', $email)->first();