app/Providers/ViewRoomChatServiceProvider.php

select * from `room_chats`
---
    public function boot(): void
    {

        View::composer('admin.layouts.partials.sidebar', function ($view) {
            $RoomChats = RoomChat::all();