app/Http/Controllers/Admin/BranchController.php

select * from `branches` order by `id` desc limit 5 offset 0
select count(*) as aggregate from `branches`
---
    public function index(Request $request)
    {
        $search = $request->input('search'); // Lấy từ khóa tìm kiếm từ request

        // Tìm kiếm theo tên nếu có từ khóa
        $branches = Branch::when($search, function ($query, $search) {
            return $query->where('name', 'like', '%' . $search . '%');
        })->latest('id')->paginate(5);

insert into `branches` (`name`, `is_active`, `surcharge`, `slug`, `updated_at`, `created_at`) values ('Quỳnh', 1, 0, 'quynh-01JKWNS0DPGCKWEZREV1S7YSQW', '2025-02-12 15:52:56', '2025-02-12 15:52:56')
---
    public function store(BranchRequest $request)
    {
        $data = $request->validated(); // Lấy dữ liệu đã validate
        try {
            $data['is_active'] = 1;
            $data['surcharge'] ??= 0;  // Thêm giá trị mặc định cho surcharge

            if (!empty($data['name'])) {
                $data['slug'] = Str::slug($data['name'], '-') . '-' . Str::ulid();
            }

            Branch::create($data);

select * from `branches` where `branches`.`id` = '4' limit 1
update `branches` set `name` = 'Hồ Chí Minh1', `branches`.`updated_at` = '2025-02-12 22:25:59' where `id` = 4
---
    public function update(BranchRequest $request, $id)
    {
        $branch = Branch::findOrFail($id);

        $data = $request->validated(); // Lấy dữ liệu đã validate

        $branch->update([
            'name' => $data['name'],

        ]);

delete from `branches` where `id` = 2
---
    public function destroy(Branch $branch)
    {
        // dd ($typeRoomRequest);
        try {
            $branch->delete(); // Sử dụng tên biến mới.