app/Http/Controllers/Admin/CinemaController.php

select * from `branches` order by `id` desc
---
    public function create()
    {
        $branchs = Branch::query()->orderByDesc('id')->get();