app/Http/Controllers/Admin/DashBoardController.php



        // PHIM HOẠT ĐỘNG HIỆN TẠI
        $activeMoviesCount = DB::table('showtimes')
            ->join('movies', 'showtimes.movie_id', '=', 'movies.id')
            ->when($cinemaId, fn($q) => $q->where('showtimes.cinema_id', $cinemaId))
            ->when($branchId, function ($q) {
                return $q->join('cinemas', 'showtimes.cinema_id', '=', 'cinemas.id')
                    ->whereColumn('cinemas.id', 'showtimes.cinema_id');
            })
            ->when($date, fn($q) => $q->whereDate('showtimes.date', $date))
            ->when(
                !$date && $selectedMonth && $selectedYear,
                fn($q) =>
                $q->whereMonth('showtimes.date', $selectedMonth)
                    ->whereYear('showtimes.date', $selectedYear)
            )
            ->where('showtimes.is_active', 1)
            ->where('movies.is_active', 1)
            ->distinct()
            ->count('showtimes.movie_id');
---
select count(distinct `movies`.`id`) as aggregate from `showtimes` inner join `movies` on `showtimes`.`movie_id` = `movies`.`id` inner join `cinemas` on `showtimes`.`cinema_id` = `cinemas`.`id` where `movies`.`is_active` = 1 and `cinemas`.`branch_id` = 5