app/Http/Controllers/Admin/DashBoardController.php

select `id`, `name` from `movies` where `is_active` = 1
---

        $branches = $branchesQuery->get();
        $cinemas = $cinemasQuery->get();
        $movies = DB::table('movies')->select('id', 'name')->where('is_active', 1)->get();

select sum(`total_price`) as aggregate from `tickets` where year(`created_at`) = 2025 and month(`created_at`) = '04'
---
    private function getTotalRevenue($month, $year, $branchId = null, $cinemaId = null, $movieId = null, $statusId = null): float
    {
        $query = Ticket::query()
            ->whereYear('created_at', $year)
            ->when($month, fn($q) => $q->whereMonth('created_at', $month))
            ->when($movieId, fn($q) => $q->where('movie_id', $movieId))
            ->when($statusId, fn($q) => $q->where('status', $statusId));

        $this->applyPermission($query, $branchId, $cinemaId);
        return $query->sum('total_price') ?: 0;

select `ticket_seats` from `tickets` where year(`created_at`) = 2025 and month(`created_at`) = '04'
---
    private function getTicketStats($month, $year, $branchId = null, $cinemaId = null, $movieId = null, $statusId = null): array
    {
        $query = Ticket::query()
            ->whereYear('created_at', $year)
            ->when($month, fn($q) => $q->whereMonth('created_at', $month))
            ->when($movieId, fn($q) => $q->where('movie_id', $movieId))
            ->when($statusId, fn($q) => $q->where('status', $statusId));

        $this->applyPermission($query, $branchId, $cinemaId);
        $tickets = $query->select('ticket_seats')->get();

select sum(`total_price`) as aggregate from `tickets` where `created_at` between '2025-04-07 00:00:00' and '2025-04-07 23:59:59'
---
    private function getRevenue($startDate, $endDate, $branchId = null, $cinemaId = null, $movieId = null, $statusId = null): float
    {
        $query = Ticket::query()
            ->whereBetween('created_at', [$startDate, $endDate])
            ->when($movieId, fn($q) => $q->where('movie_id', $movieId))
            ->when($statusId, fn($q) => $q->where('status', $statusId));

        $this->applyPermission($query, $branchId, $cinemaId);
        return $query->sum('total_price') ?: 0;

select `ticket_seats` from `tickets` where `created_at` between '2025-04-07 00:00:00' and '2025-04-07 23:59:59'
---
    private function getTicketCount($startDate, $endDate, $branchId = null, $cinemaId = null, $movieId = null, $statusId = null): int
    {
        $query = Ticket::query()
            ->whereBetween('created_at', [$startDate, $endDate])
            ->when($movieId, fn($q) => $q->where('movie_id', $movieId))
            ->when($statusId, fn($q) => $q->where('status', $statusId));

        $this->applyPermission($query, $branchId, $cinemaId);
        $tickets = $query->select('ticket_seats')->get();

select sum(`total_price`) as aggregate from `tickets` where year(`created_at`) = 2025 and month(`created_at`) = '01'
---
    private function getYearlyRevenue($year, $branchId = null, $cinemaId = null, $movieId = null, $statusId = null): string
    {
        $monthlyRevenues = [];
        for ($month = 1; $month <= 12; $month++) {
            $query = Ticket::query()
                ->whereYear('created_at', $year)
                ->whereMonth('created_at', $month)
                ->when($movieId, fn($q) => $q->where('movie_id', $movieId))
                ->when($statusId, fn($q) => $q->where('status', $statusId));

            $this->applyPermission($query, $branchId, $cinemaId);
            $revenue = $query->sum('total_price') ?: 0;

select `cinemas`.`name` as `cinema_name`, SUM(COALESCE(tickets.total_price, 0)) as revenue from `tickets` inner join `cinemas` on `tickets`.`cinema_id` = `cinemas`.`id` where year(`tickets`.`created_at`) = 2025 and month(`tickets`.`created_at`) = '04' group by `cinemas`.`id`, `cinemas`.`name` order by `revenue` desc
---
    private function getRevenueByCinema($month, $year, $branchId = null, $cinemaId = null, $movieId = null, $statusId = null): array
    {
        $query = Ticket::query()
            ->join('cinemas', 'tickets.cinema_id', '=', 'cinemas.id')
            ->whereYear('tickets.created_at', $year)
            ->when($month, fn($q) => $q->whereMonth('tickets.created_at', $month))
            ->when($movieId, fn($q) => $q->where('tickets.movie_id', $movieId))
            ->when($statusId, fn($q) => $q->where('tickets.status', $statusId));

        $this->applyPermission($query, $branchId, $cinemaId);
        $revenueByCinema = $query->select(
            'cinemas.name as cinema_name',
            DB::raw('SUM(COALESCE(tickets.total_price, 0)) as revenue')
        )
            ->groupBy('cinemas.id', 'cinemas.name')
            ->orderBy('revenue', 'desc')
            ->get();

        $revenueSeries = $revenueByCinema->pluck('revenue')->map(fn($value) => round((float) $value / 1000000, 2))->toArray();
        $cinemaLabels = $revenueByCinema->pluck('cinema_name')->toArray();