app/Http/Controllers/Admin/RankController.php

select * from `ranks` order by `total_spent` asc
---
    public function index()
    {
        $ranks = Rank::query()->orderBy('total_spent', 'asc')->get();

select count(*) as aggregate from `ranks`
---
    public function store(RankRequest $request)
    {
        try {
            if (Rank::count() < Rank::MAX_RANK) {