app/Http/Controllers/Admin/SeatTemplateControler.php

select * from `seat_templates` where `seat_templates`.`id` = '1' limit 1
---
    public function edit(string $id)
    {

         [$seatTemplate, $matrix, $seatMap,$type_seats] = $this->seatTemplateService->editService($id);
        return view(self::PATH_VIEW . __FUNCTION__, compact('matrix', 'seatTemplate', 'seatMap','type_seats'));

        $seatTemplate = Seat_template::query()->findOrFail($id);