app/Http/Controllers/Admin/TypeSeatController.php

select * from `type_seats` order by `id` desc
---
    public function index()
    {
        $typeSeats = Type_seat::query()->latest('id')->get(); // Đổi tên biến cho dễ hiểu.