app/Http/Controllers/Admin/TyperoomController.php

select * from `type_rooms` order by `id` desc
---
    public function index()
    {
        $type_rooms = Type_room::with('branch')->orderByDesc('id')->get();