app/Http/Controllers/Admin/UserController.php

    public function index(Request $request)
    {
        // $users = User::orderByDesc('id')->get();
        $branchs = Branch::all();
        $branchId = $request->input('branch_id');

        $users = User::where('type_user', 1);

        // Kiểm tra vai trò 'System Admin' của người dùng hiện tại
        if (auth()->user()->hasRole("System Admin")) {
            $users = $users->when($branchId, function ($query) use ($branchId) {
                // Lấy các bản ghi có branch_id từ yêu cầu
                return $query->where('branch_id', $branchId)
                    // Lấy thêm bản ghi có cinema_id thông qua quan hệ với cinema và branch
                    ->orWhereHas('cinema', function ($cinemaQuery) use ($branchId) {
                        $cinemaQuery->whereHas('branch', function ($branchQuery) use ($branchId) {
                            $branchQuery->where('id', $branchId);
                        });
                    });
            });
---
select * from `cinemas`