app/Http/Controllers/Admin/UserVoucherController.php

select * from `user_vouchers` order by `id` desc limit 10 offset 0
select * from `users` where `users`.`id` in (1) and `users`.`deleted_at` is null
select * from `vouchers` where `vouchers`.`id` in (1)
select count(*) as aggregate from `user_vouchers`
---
    public function index()
    {
        $User_vouchers = User_voucher::with(['user', 'voucher'])->latest('id')->paginate(10);

select * from `users` where `users`.`deleted_at` is null
select * from `vouchers` where `is_active` = 1
---
    public function create()
    {
        $users = User::all();
        $vouchers = Voucher::where('is_active', 1)->get();

select exists(select * from `user_vouchers` where `user_id` = '1' and `voucher_id` = '6') as `exists`
insert into `user_vouchers` (`created_at`, `updated_at`, `usage_count`, `user_id`, `voucher_id`) values ('2025-02-12 22:11:42', '2025-02-12 22:11:42', '1', '1', '6'), ('2025-02-12 22:11:42', '2025-02-12 22:11:42', '1', '2', '6')
---
    public function store(UserVoucherRequest $request)
<<<<<<< HEAD
    {
        try {
            $data = $request->validated();

            // Kiểm tra nếu có nhiều người dùng được chọn
            if (!empty($data['user_ids']) && is_array($data['user_ids'])) {
                $insertData = [];

                foreach ($data['user_ids'] as $userId) {
                    if (!User_voucher::where('user_id', $userId)
                        ->where('voucher_id', $data['voucher_id'])
                        ->exists()) {

                        $insertData[] = [
                            'user_id' => $userId,
                            'voucher_id' => $data['voucher_id'],
                            'usage_count' => $data['usage_count'] ?? 0,
                            'created_at' => now(),
                            'updated_at' => now(),
                        ];
                    }
                }

                if (!empty($insertData)) {
                    User_voucher::insert($insertData);