app/Http/Controllers/Admin/UserController.php

select * from `roles`
---
    public function index()
    {
        // $users = User::orderByDesc('id')->get();
        $users = User::where('type_user', 1)->with('cinema.branch')->get();

        $roles = Role::all();

select `branch_id` from `cinemas` where `is_active` = '1' limit 1
---
    public function create()
    {
        $typeAdmin = User::TYPE_ADMIN;
        $roles = Role::all();
        $branches = Branch::where('is_active', 1)->get();


        if (auth()->user()->hasRole("Quản lý chi nhánh")) {
            $cinemas = Cinema::where('is_active', '1')
                ->where('branch_id', auth()->user()->branch_id)
                ->get();