app/Http/Controllers/Admin/VoucherController.php

delete from `vouchers` where `id` = 2
---
    public function destroy(Voucher $voucher)
    {
        // dd ($typeRoomRequest);
        try {
            $voucher->delete(); // Sử dụng tên biến mới.