app/Http/Controllers/Admin/VoucherController.php

    public function index(Request $request)
    {
        $search = $request->input('search'); // Lấy từ khóa tìm kiếm từ request

        // Chỉ lọc danh sách voucher theo mã
        $vouchers = Voucher::when($search, function ($query, $search) {
            return $query->where('code', 'like', '%' . $search . '%');
        })->latest('id')->paginate(5);
---
select * from `vouchers` order by `id` desc limit 5 offset 0
select count(*) as aggregate from `vouchers`

    public function store(VoucherRequest $request)

    {
        try {
            // Nếu không nhập mã, tạo mã ngẫu nhiên
            $code = $request->code ?? strtoupper(Str::random(10));

            // Kiểm tra trùng lặp
            while (Voucher::where('code', $code)->exists()) {
                $code = strtoupper(Str::random(10));
            }

            $data = $request->all();
            $data['code'] = $code;
            $data['is_active'] = $request->has('is_active') ? 1 : 0;
            $data['limit_by_user'] = $data['limit_by_user'] ?? 1;
            $data['discount'] = $data['discount'] ?? 0;

            Voucher::create($data);
---
select exists(select * from `vouchers` where `code` = 'Z5YQC85PVA') as `exists`
insert into `vouchers` (`code`, `discount`, `start_date_time`, `end_date_time`, `quantity`, `limit_by_user`, `title`, `description`, `is_active`, `updated_at`, `created_at`) values ('WSODGAJJVZ', 15000, '2025-02-13T22:20', '2025-02-28T22:20', '66', '1', '66', '666', '1', '2025-02-12 22:21:06', '2025-02-12 22:21:06')

    public function destroy(Voucher $voucher)
    {
        // dd ($typeRoomRequest);
        try {

            $voucher->delete();
---
delete from `vouchers` where `id` = 3