app/Http/Controllers/Admin/VoucherController.php

update `vouchers` set `title` = '777777', `start_date_time` = '2025-02-14T22:04', `end_date_time` = '2025-02-23T22:04', `discount` = 100000, `quantity` = '71', `vouchers`.`updated_at` = '2025-02-12 22:09:37' where `id` = 5
---
    public function update(VoucherRequest $request, Voucher $voucher)
    {
        try {
            // Lấy dữ liệu từ request
            $data = $request->all();

            // Loại bỏ dấu phẩy trước khi lưu vào database
            $data['discount'] = (int) str_replace(',', '', $request->input('discount'));

            // Cập nhật bản ghi trong cơ sở dữ liệu
            $voucher->update($data);